examples/smwcon/smwcon.puml
package SMWCon {
  class Attendee {
    name:Text
    firstName:Text
    jobTitle:Text
    email:EMail
    crm:Text
    picture:Text
    socialLinks:Text
    introduction:Text
    publish:Boolean
    events:Text
  }
Note top of Attendee
A participant of an event
End note
  class Talk {
    status:Text
    title:Text
    description:Text
    duration:Number
    audience:Text
    type:Text
    start:Date
    stop:Date
    video:URL
    keywords:Text
  }
Note top of Talk
A presentation or speech given at an
event
End note
  class Event {
    conference:Text
    description:Text
    address:Text
    start:Date
    finish:Date
    calendar:Text
    Type:Text
    GeneralChair:Text
    LocalChair:Text
    ProgramChair:Text
    SponsorshipChair:Text
    Audience:Text
    Collection:Text
    Wikidata:Text
  }
Note top of Event
A conference or gathering
End note
  class Location {
    name:Text
    address:Text
    city:Text
    country:Text
    capacity:Number
    facilities:Text
  }
Note top of Location
A place where an event is held
End note
}
Event "event 1" -- "attendees *" Attendee
Talk "talk 1" -- "speakers *" Attendee
Event "event 1" -- "talks *" Talk
Location "location 1" -- "events *" Event

' BITPlan Corporate identity skin params
' Copyright (c) 2015-2024 BITPlan GmbH
' see http://wiki.bitplan.com/PlantUmlSkinParams#BITPlanCI
' skinparams generated by com.bitplan.restmodelmanager
skinparam note {
  BackGroundColor #FFFFFF
  FontSize 12
  ArrowColor #FF8000
  BorderColor #FF8000
  FontColor black
  FontName Technical
}
skinparam component {
  BackGroundColor #FFFFFF
  FontSize 12
  ArrowColor #FF8000
  BorderColor #FF8000
  FontColor black
  FontName Technical
}
skinparam package {
  BackGroundColor #FFFFFF
  FontSize 12
  ArrowColor #FF8000
  BorderColor #FF8000
  FontColor black
  FontName Technical
}
skinparam usecase {
  BackGroundColor #FFFFFF
  FontSize 12
  ArrowColor #FF8000
  BorderColor #FF8000
  FontColor black
  FontName Technical
}
skinparam activity {
  BackGroundColor #FFFFFF
  FontSize 12
  ArrowColor #FF8000
  BorderColor #FF8000
  FontColor black
  FontName Technical
}
skinparam classAttribute {
  BackGroundColor #FFFFFF
  FontSize 12
  ArrowColor #FF8000
  BorderColor #FF8000
  FontColor black
  FontName Technical
}
skinparam interface {
  BackGroundColor #FFFFFF
  FontSize 12
  ArrowColor #FF8000
  BorderColor #FF8000
  FontColor black
  FontName Technical
}
skinparam class {
  BackGroundColor #FFFFFF
  FontSize 12
  ArrowColor #FF8000
  BorderColor #FF8000
  FontColor black
  FontName Technical
}
skinparam object {
  BackGroundColor #FFFFFF
  FontSize 12
  ArrowColor #FF8000
  BorderColor #FF8000
  FontColor black
  FontName Technical
}
hide Circle
' end of skinparams '
